In [2]:
import numpy as np
import pandas as pd

In [7]:
myDict = {
    "name": ["Ahmet","Kaan","Ayşe","Fatma","Veli"],
    "age": [21,20,25,24,12],
    "salary": [7000,8000,9000,0,2500]
}

df1 = pd.DataFrame(myDict)
df1

    name  age  salary
0  Ahmet   21    7000
1   Kaan   20    8000
2   Ayşe   25    9000
3  Fatma   24       0
4   Veli   12    2500

In [10]:
print(df1.head())

    name  age  salary
0  Ahmet   21    7000
1   Kaan   20    8000
2   Ayşe   25    9000
3  Fatma   24       0
4   Veli   12    2500

In [12]:
print(df1.tail())

    name  age  salary
0  Ahmet   21    7000
1   Kaan   20    8000
2   Ayşe   25    9000
3  Fatma   24       0
4   Veli   12    2500

In [14]:
columns = df1.columns
for element in columns:
    print(element)

name
age
salary

In [17]:
info = df1.info()
info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [19]:
datatypes = df1.dtypes
datatypes

name      object
age        int64
salary     int64
dtype: object

In [21]:
print(df1.describe())

             age       salary
count   5.000000     5.000000
mean   20.400000  5300.000000
std     5.128353  3866.522986
min    12.000000     0.000000
25%    20.000000  2500.000000
50%    21.000000  7000.000000
75%    24.000000  8000.000000
max    25.000000  9000.000000

In [35]:
print(df1.name,df1.age)

0    Ahmet
1     Kaan
2     Ayşe
3    Fatma
4     Veli
Name: name, dtype: object 0    21
1    20
2    25
3    24
4    12
Name: age, dtype: int64

In [36]:
df1["new property"] = ["a","b","c","d","e"]
df1

    name  age  salary new property
0  Ahmet   21    7000            a
1   Kaan   20    8000            b
2   Ayşe   25    9000            c
3  Fatma   24       0            d
4   Veli   12    2500            e

In [27]:
df1[["name","age"]] # df1["name"]

    name  age
0  Ahmet   21
1   Kaan   20
2   Ayşe   25
3  Fatma   24
4   Veli   12

In [30]:
df1.loc[:,"age"]

0    21
1    20
2    25
3    24
4    12
Name: age, dtype: int64

In [33]:
pdseries1 = df1.loc[:,"age"].copy()
pdseries1

0    21
1    20
2    25
3    24
4    12
Name: age, dtype: int64

In [38]:
df1.loc[::-1,:] # reverses the table

    name  age  salary new property
4   Veli   12    2500            e
3  Fatma   24       0            d
2   Ayşe   25    9000            c
1   Kaan   20    8000            b
0  Ahmet   21    7000            a

In [40]:
df1.loc[:,::-1] # reverses the columns

  new property  salary  age   name
0            a    7000   21  Ahmet
1            b    8000   20   Kaan
2            c    9000   25   Ayşe
3            d       0   24  Fatma
4            e    2500   12   Veli

In [42]:
df1.loc[:3,:] # take data until 3rd column in the table

    name  age  salary new property
0  Ahmet   21    7000            a
1   Kaan   20    8000            b
2   Ayşe   25    9000            c
3  Fatma   24       0            d

In [45]:
df1.loc[:3,"name":"salary"]

    name  age  salary
0  Ahmet   21    7000
1   Kaan   20    8000
2   Ayşe   25    9000
3  Fatma   24       0

In [47]:
df1.loc[:,["salary","name"]]

   salary   name
0    7000  Ahmet
1    8000   Kaan
2    9000   Ayşe
3       0  Fatma
4    2500   Veli

In [50]:
df1.iloc[:3,1:3]

   age  salary
0   21    7000
1   20    8000
2   25    9000

In [51]:
# filter
salaryFilter = df1.salary > 3000
salaryFilter

0     True
1     True
2     True
3    False
4    False
Name: salary, dtype: bool

In [53]:
df1[salaryFilter]

    name  age  salary new property
0  Ahmet   21    7000            a
1   Kaan   20    8000            b
2   Ayşe   25    9000            c

In [55]:
ageFilter = df1.age > 20
ageFilter

0     True
1    False
2     True
3     True
4    False
Name: age, dtype: bool

In [58]:
df1[salaryFilter & ageFilter]

    name  age  salary new property
0  Ahmet   21    7000            a
2   Ayşe   25    9000            c

In [61]:
df1[df1.salary > 7000]

   name  age  salary new property
1  Kaan   20    8000            b
2  Ayşe   25    9000            c

In [63]:
average_salary = np.mean(df1.salary)
average_salary

5300.0

In [65]:
average_salary1 = df1.salary.mean()
average_salary1

5300.0

In [66]:
for e in df1.salary:
    if(e < average_salary1):
        print("low salary")
    else:
        print("enough salary")

enough salary
enough salary
enough salary
low salary
low salary

In [73]:
df1["salary lvl"] = ["low salary" if e < average_salary1 else "enough salary" for e in df1.salary]
print(df1["salary lvl"])
print(df1)

0    enough salary
1    enough salary
2    enough salary
3       low salary
4       low salary
Name: salary lvl, dtype: object
    name  age  salary new property     salary lvl
0  Ahmet   21    7000            a  enough salary
1   Kaan   20    8000            b  enough salary
2   Ayşe   25    9000            c  enough salary
3  Fatma   24       0            d     low salary
4   Veli   12    2500            e     low salary

In [80]:
age_lvl = []
for e in df1.age:
    if e < 18:
        age_lvl.append("young")
    else: 
        age_lvl.append("old")
df1["age lvl"] = age_lvl
df1

    name  age  salary new property     salary lvl age lvl
0  Ahmet   21    7000            a  enough salary     old
1   Kaan   20    8000            b  enough salary     old
2   Ayşe   25    9000            c  enough salary     old
3  Fatma   24       0            d     low salary     old
4   Veli   12    2500            e     low salary   young

In [83]:
df1.columns = [e.upper() for e in df1.columns]
df1.columns

Index(['NAME', 'AGE', 'SALARY', 'NEW PROPERTY', 'SALARY LVL', 'AGE LVL'], dtype='object')

In [85]:
df1.columns = [each.split()[0]+"_"+each.split()[1] if len(each.split())> 1 else each for each in df1.columns]
df1.columns

Index(['NAME', 'AGE', 'SALARY', 'NEW_PROPERTY', 'SALARY_LVL', 'AGE_LVL'], dtype='object')

In [88]:
#df1.drop("NEW_PROPERTY",axis = 1,inplace = True)
#df1

KeyError: "['NEW_PROPERTY'] not found in axis"

In [90]:
df1h=df1.head()
df1t=df1.tail()
df_concat=pd.concat([df1h,df1t],axis=0)
df_concat

    NAME  AGE  SALARY     SALARY_LVL AGE_LVL
0  Ahmet   21    7000  enough salary     old
1   Kaan   20    8000  enough salary     old
2   Ayşe   25    9000  enough salary     old
3  Fatma   24       0     low salary     old
4   Veli   12    2500     low salary   young
0  Ahmet   21    7000  enough salary     old
1   Kaan   20    8000  enough salary     old
2   Ayşe   25    9000  enough salary     old
3  Fatma   24       0     low salary     old
4   Veli   12    2500     low salary   young